import React from "react";
import progLanguage from "../../assets/png/progRelevance.png";
import styles from "./RelevancePanel.module.css";
export const Relevance = ({className}) => {
    return (
        <div className={`${styles.panel} ${className}`}>
            <img src={progLanguage}></img>
            <div>
                <h2>Актуальність</h2>
            <p>
                На сьогодні програмування стало важливим інструментом у багатьох галузях, від бізнесу та науки до мистецтва й освіти.
                Воно не лише розвиває навички логічного мислення і вирішення проблем, але й надає можливість автоматизувати рутинні завдання, аналізувати великі обсяги даних і створювати інноваційні рішення.
                Завдяки розвитку інтернету та мобільних технологій, знання програмування відкриває перед людьми широкий спектр кар'єрних можливостей, дозволяючи їм створювати програми, які змінюють життя людей і впливають на розвиток суспільства.
            </p>
            </div>
        </div>
    )
}

export default Relevance;