import React from "react";
import styles from "./AboutProg.module.css"
import progLanguages from "../../assets/png/progLanguages.png"
export const AboutProg = () => {
    return (
        <div className={styles.panel}>
            <img src = {progLanguages} alt="Картинка мов програмування"></img>
            <div>
                <h2>Про програмування</h2>
                <p>
                     Програмування — це процес створення інструкцій для комп'ютерів, що дозволяє їм виконувати певні завдання або розв'язувати задачі.
                    Використовуючи мови програмування, розробники пишуть код, який визначає дії комп'ютера та взаємодію з користувачем.
                    Існує багато мов програмування, таких як Python, Java, C++, кожна з яких має свої особливості та переваги для вирішення різних типів задач.
                    Програмування є невід'ємною частиною сучасної технології, оскільки завдяки йому створюються програми, вебсайти, мобільні додатки, ігри та інші цифрові продукти.
                </p>
            </div>
        </div>
    )
}

export default AboutProg;